<a href="https://colab.research.google.com/github/mwass/collab_notebooks/blob/master/Copy_of_AfterWork_Data_Science_Sampling_Techniques_with_Python_Notebook.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<font color="blue">To use this notebook on Google Colaboratory, you will need to make a copy of it. Go to **File** > **Save a Copy in Drive**. You can then use the new copy that will appear in the new tab.</font>

# Sampling Techniques with Python Notebook

## 1. Simple Random Sampling (SRS)

### Importing our Prerequisites

In [0]:
# Importing pandas for performing data maniputation
# 
import pandas as pd

# Importing numpy for performing scientific computations
import numpy as np

# Importing random module for random sampling
# 
import random

### Examples

In [0]:
# Example 1
# ---
# Selecting a random sample without replacement
# ---
# Some data can be stored in a list and you would be required to select more than 
# one item from that particular list. 
# ---
# In this example, we will be selecting more than one item from a given list. 
# We will use the random.sample() function to return a particular subset list 
# of items from the given list.
# The function is normally used for random sampling without replacement.
# k in the function, will be an integer value that will specify the length of a sample.
# ---
# 

# Defining our list 
# 
example_list = [10, 15, 20, 25, 30, 35, 40, 45, 50, 55]

# Then select a sample of 2 items
# 
print("Selecting 2 random items from our list", random.sample(example_list, k = 2))

Selecting 2 random items from our list [20, 40]

In [0]:
# Example 2
# ---
# We can also select a random sample with replacement from a given list.
# This would mean that we can get the same item more than once during sampling.
# Let's do this through the use of the random.choice() function.
# ---
#

# Defining our list
# ---
#
footballers = ["Messi", "Ronaldo", "Salah", "Mane", "Alison", "Van Dyke", "Relah"]

# Then select a sample of 4 items
# 
print("Random sample with replacement:", random.choices(footballers, k = 4))

Random sample with replacement: ['Mane', 'Mane', 'Van Dyke', 'Mane']

In [0]:
# Challenge 3
# ---
# We can also select a random sample from a given dataset as show below:
# ---
#

# We first import and preview our dataset.
# This will help us understand our dataset before doing anything else.
# ---
# 
spending_df = pd.read_csv("https://bit.ly/2WtrItx")
spending_df.head()

   CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [0]:
# We then determine the size of our dataset;  (records, columns) 
# ---
#
spending_df.shape

(200, 5)

In [0]:
# Then lastly, we select and preview a random sample of 10 records 
# as using the sample() function as shown below.  
# ---
#
spending_df.sample(10)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
106         107  Female   66                  63                      50
23           24    Male   31                  25                      73
48           49  Female   29                  40                      42
93           94  Female   40                  60                      40
188         189  Female   41                 103                      17
143         144  Female   32                  76                      87
142         143  Female   28                  76                      40
11           12  Female   35                  19                      99
138         139    Male   19                  74                      10
113         114    Male   19                  64                      46

### <font color="green">Challenges</font>

In [0]:
# Challenge 1
# ---
# Select a random sample of 5 items from the given list.
# ---
# OUR CODE GOES BELOW
# 

# Creating our list 
# ---
# 
cities = ['Nairobi', 'Amsterdam', 'Johannesburg', 'Port Louis', 'St. Petersburg', 'Warsaw', 'Cairo', 'Lyon']
random.sample(cities, k=5)

['Cairo', 'Nairobi', 'Lyon', 'Amsterdam', 'St. Petersburg']

In [0]:
# Challenge 2
# ---
# Select a random sample of 3 items with replacement from the given list.
# ---
# OUR CODE GOES BELOW
# 

# Creating our list
# ---
#
cities = ['Nairobi', 'Amsterdam', 'Johannesburg', 'Port Louis', 'St. Petersburg', 'Warsaw', 'Cairo', 'Lyon']
random.choices(cities, k=5)

['Johannesburg', 'St. Petersburg', 'Port Louis', 'Amsterdam', 'St. Petersburg']

In [0]:
# Challenge 3
# ---
# Select a random sample of 100 records from the given dataset.
# ---
# Dataset url = https://bit.ly/2XUisQ4
# ---
# OUR CODE GOES BELOW
# 
my_sample = pd.read_csv("https://bit.ly/2XUisQ4")
my_sample.sample(100)

               hotel  is_canceled  ...  reservation_status  reservation_status_date
53902     City Hotel            1  ...            Canceled               2016-04-27
53109     City Hotel            1  ...            Canceled               2016-01-08
62049     City Hotel            1  ...            Canceled               2016-07-27
99015     City Hotel            0  ...           Check-Out               2016-10-08
55732     City Hotel            1  ...            Canceled               2016-03-15
...              ...          ...  ...                 ...                      ...
28075   Resort Hotel            0  ...           Check-Out               2016-09-19
107555    City Hotel            0  ...           Check-Out               2017-03-15
40426     City Hotel            0  ...           Check-Out               2015-07-28
108681    City Hotel            0  ...           Check-Out               2017-03-31
24457   Resort Hotel            0  ...           Check-Out               2016-05-22

[100 rows x 32 columns]

## 2. Systematic Sampling

### Examples

In [0]:
# Example 1
# ---
# We will use this example to demonstrate how we can perform systematic sampling.
# This systematic sampling example in this notebook has been borrowed from 
# https://bit.ly/SamplingSourceLink with some modifications.
# ---
# Let's first recall abit of some theory. The idea of systematic sampling is that, 
# given the population units numbered from 1 to N, we compute for the sampling interval, 
# given by  k = N / n, where  n  is the number of units needed for the sample. 
# After that, we choose for the random start, number between  1  and  k. 
# This random start becomes the first sample, and then the second unit in the sample 
# is obtained by adding the sampling interval to the random start, and so on. 
# ---
# There are two types of systematic sampling namely, linear and circular systematic sampling. 
# Circular systematic sampling treats the population units numbered from 1 to N in circular form,
# such that if the increment step is more than the number of N units, say N + 2, 
# the sample unit is the 2nd element in the population, and so on. 
# The following code that we will use can be used both for linear and circular. 
# ---
# Question: Perform systematic sampling given the following list.
# ---
#
 
# The dataset that we will use a numpy array which means
# we create our list then convert it to a numpy array as shown
# ---
# 
salary_data = [2500, 1500, 2000, 2500, 1800, 1200, 2400, 3000, 1500, 2000, 1000, 1000, 1100]
salary_data = np.array(salary_data) 

# The function to used for systematic sampling
# ---
# 
def sys_sample(df, r, n):
    k = df.shape[0] // n

    b = [None] * n; a = r
    b[0] = a

    for i in np.arange(1, n):
        a = a + k

        if a > df.shape[0]:
            a = a - df.shape[0]

        b[i] = a

    return {"Sample data" : df[b], "Index/Position" : b, "K" : k}


# We then call our sampling function with the appropriate parameters
# for random start, r = 2, and defining the number of samples, n = 4.
# ---
#  
sys_sample(salary_data, r = 1, n = 4)

{'Index/Position': [1, 4, 7, 10],
 'K': 3,
 'Sample data': array([1500, 1800, 3000, 1000])}

In [0]:
# Example 2
# ---
# Let's now work with a dataset by using the customer dataset we imported earlier.
# ---

# Then let's recreate the above function for systematic sampling
# then tweak it abit by returning our sampled values

def sys_sample(df, r, n):
    k = df.shape[0] // n

    b = [None] * n; a = r
    b[0] = a

    for i in np.arange(1, n):
        a = a + k

        if a > df.shape[0]:
            a = a - df.shape[0]

        b[i] = a

    return spending_df[spending_df.index.isin(b)]  

# Performing sampling for random start, r = 2, 
# and defining the number of samples, n = 4
# ---
# 
sys_sample(spending_df, r = 2, n = 4)

     CustomerID  Gender  Age  Annual Income (k$)  Spending Score (1-100)
2             3  Female   20                  16                       6
52           53  Female   31                  43                      54
102         103    Male   67                  62                      59
152         153  Female   44                  78                      20

### <font color="green">Challenges</font>

In [0]:
# Challenge 1
# ---
# Create a systematic sample from the following cities list. 
# ---
# cities = ['Nairobi', 'Amsterdam', 'Johannesburg', 'Port Louis', 'St. Petersburg', 'Warsaw', 'Cairo', 'Lyon']
# ---
# OUR CODE GOES BELOW
# 
def sys_sample(df, r, n):
    k = df.shape[0] // n

    b = [None] * n; a = r
    b[0] = a

    for i in np.arange(1, n):
        a = a + k

        if a > df.shape[0]:
            a = a - df.shape[0]

        b[i] = a

    return {"Sample data" : df[b], "Index/Position" : b, "K" : k}
    
cities = ['Nairobi', 'Amsterdam', 'Johannesburg', 'Port Louis', 'St. Petersburg', 'Warsaw', 'Cairo', 'Lyon']
cities = np.array(cities)
sys_sample(cities, r = 1, n = 4)

{'Index/Position': [1, 3, 5, 7],
 'K': 2,
 'Sample data': array(['Amsterdam', 'Port Louis', 'Warsaw', 'Lyon'], dtype='<U14')}

In [4]:
# Challenge 2
# ---
# Perfom systematic sampling on the following Rio City temperature.
# ---
# Dataset url = https://bit.ly/RioTemperature
# ---
# OUR CODE GOES BELOW
# 
def sys_sample(df, r, n):
    k = df.shape[0] // n

    b = [None] * n; a = r
    b[0] = a

    for i in np.arange(1, n):
        a = a + k

        if a > df.shape[0]:
            a = a - df.shape[0]

        b[i] = a

    return df[df.index.isin(b)]

rio_temperature = pd.read_csv("https://bit.ly/RioTemperature")
sys_sample(rio_temperature, r = 2, n = 4)

    YEAR     JAN    FEB    MAR    APR  ...   D-J-F  M-A-M  J-J-A  S-O-N  metANN
2   1975   25.27  26.92  26.43  22.82  ...   25.58  23.54  21.05  23.05   23.31
13  1986  999.90  27.93  26.95  25.97  ...  999.90  25.45  22.15  23.42   24.60
24  1997   26.52  28.03  25.35  24.57  ...   27.02  24.12  21.76  24.60   24.38
35  2008   26.25  26.54  26.37  25.28  ...   26.59  24.78  21.78  23.51   24.16

[4 rows x 18 columns]

## 3. Stratified Sampling

### Examples

In [4]:
# Example 1
# ---
# While performing stratified sampling, we can perform a sample a fraction 
# of each group as shown in this example:
# ----
# Dataset url = https://bit.ly/2WtrItx

# Lets first import and preview our dataset
# ---
#
df_customers = pd.read_csv('https://bit.ly/2y5CRYc')
df_customers.head()

   age     sex   bmi  children smoker     region  expenses
0   19  female  27.9         0    yes  southwest  16884.92
1   18    male  33.8         1     no  southeast   1725.55
2   28    male  33.0         3     no  southeast   4449.46
3   33    male  22.7         0     no  northwest  21984.47
4   32    male  28.9         0     no  northwest   3866.86

In [5]:
# We then use groupby.apply() with sample as shown below.
# In the process we use frac to define the fraction of our group we would like to get.
# ---
# 
df_customers.groupby('sex').apply(pd.DataFrame.sample, frac=.005)


# Method 2
# ---
# Alternatively, if MultiIndex is not required, we may specify group_keys = False 
# to groupby and get our stratified sampling:
# ---
# df_customers.groupby('sex', group_keys = False).apply(pd.DataFrame.sample, frac=.005)

             age     sex   bmi  children smoker     region  expenses
sex
female 429    27  female  30.4         3     no  northwest  18804.75
       13     56  female  39.8         0     no  southeast  11090.72
       1271   25  female  34.5         0     no  northwest   3021.81
male   859    57    male  28.1         0     no  southwest  10965.45
       144    30    male  28.7         3    yes  northwest  20745.99
       1209   59    male  37.1         1     no  southwest  12347.17

In [6]:
# Example 2
# ---
# If we would like to sample a fixed number of rows, 
# we can shuffle the DataFrame beforehand, then use the groupby().head()
# ----
# 
df_customers.sample(frac=1).groupby('sex').head(2)


# Method 2
# ---
# df_customers.groupby('sex', group_keys=False).apply(pd.DataFrame.sample, n=2)

      age     sex   bmi  children smoker     region  expenses
1197   41    male  33.6         0     no  southeast   5699.84
385    19    male  34.4         0     no  southwest   1261.86
1276   22  female  30.4         0     no  northeast   2741.95
174    24  female  33.3         0     no  northwest   2855.44

### <font color="green">Challenges</font>

In [9]:
# Challenge
# ---
# Question: Going through a Airbus' restaurants sales datset, you would like to perform 
# data analysis to understand the customers better. Select stratified samples of 
# a fraction of records and of a fixed number of records using the following 
# dataset based on day.
# ---
# Dataset url = https://bit.ly/AirlinePassDataset
# ---
# OUR CODE GOES BELOW
# 
airbus_data = pd.read_csv("https://bit.ly/AirlinePassDataset")
airbus_data.sample(frac=1).groupby('size').head(2)

     Unnamed: 0  total_bill   tip     sex smoker   day    time  size
64           64       17.59  2.64    Male     No   Sat  Dinner     3
101         101       15.38  3.00  Female    Yes   Fri  Dinner     2
66           66       16.45  2.47  Female     No   Sat  Dinner     2
204         204       20.53  4.00    Male    Yes  Thur   Lunch     4
52           52       34.81  5.20  Female     No   Sun  Dinner     4
102         102       44.30  2.50  Female    Yes   Sat  Dinner     3
82           82       10.07  1.83  Female     No  Thur   Lunch     1
125         125       29.80  4.20  Female     No  Thur   Lunch     6
111         111        7.25  1.00  Female     No   Sat  Dinner     1
156         156       48.17  5.00    Male     No   Sun  Dinner     6
187         187       30.46  2.00    Male    Yes   Sun  Dinner     5
216         216       28.15  3.00    Male    Yes   Sat  Dinner     5

## 4. Cluster Sampling

### Examples

In [0]:
# Example 1
# ---
# There are many solutions ways to performing cluster sampling.
# In this example, we will be using one of the most popular methods 
# of performing cluster sampling which is the use of the K-Means Algorithm 
# ---
# This algorithm will partion our data into k clusters such that data points 
# in the same cluster are similar, and data points in the different 
# clusters are away from each other. The value of k would be the 
# no. of clusters/samples we intend to have. 
# ---
#

# Let's first import our algorithm 
# ---
# 
from sklearn.cluster import KMeans

In [12]:
# Then import the dataset that we would like to create a cluster sample from.
# ---
# Dataset url = https://bit.ly/RioTemperature

# This dataset contains telecom subscribers data.
# ---
# 
rio_temp_df = pd.read_csv('https://bit.ly/RioTemperature')
rio_temp_df.head()

   YEAR    JAN    FEB    MAR    APR  ...  D-J-F  M-A-M  J-J-A  S-O-N  metANN
0  1973  27.73  27.97  25.70  26.49  ...  27.45  24.87  21.98  22.33   24.16
1  1974  26.68  27.16  26.56  23.94  ...  26.56  24.42  21.24  23.41   23.91
2  1975  25.27  26.92  26.43  22.82  ...  25.58  23.54  21.05  23.05   23.31
3  1976  27.48  26.20  25.55  24.99  ...  26.74  24.18  20.82  22.58   23.58
4  1977  27.13  28.51  26.88  24.22  ...  27.07  24.48  22.50  23.61   24.42

[5 rows x 18 columns]

In [13]:
# We then select the data that we would like to work with.
# The following code will select all the values and store them in
# an array containing a feature matrix that we will pass it 
# to our Kmeans algorithm for clustering.
# ---
# This is the format that our algorithm will accept.
# ---
# 
X = rio_temp_df.iloc[:,].values

# Let's preview our resulting data. 
# We can make comparisons with the previewed data in the previous cell.
# ---
# 
X

array([[1973.  ,   27.73,   27.97,   25.7 ,   26.49,   22.42,   22.76,
          22.14,   21.03,   21.46,   22.46,   23.06,   25.85,   27.45,
          24.87,   21.98,   22.33,   24.16],
       [1974.  ,   26.68,   27.16,   26.56,   23.94,   22.76,   20.7 ,
          21.2 ,   21.81,   22.91,   22.8 ,   24.51,   24.54,   26.56,
          24.42,   21.24,   23.41,   23.91],
       [1975.  ,   25.27,   26.92,   26.43,   22.82,   21.37,   20.5 ,
          19.68,   22.98,   22.4 ,   22.65,   24.11,   26.53,   25.58,
          23.54,   21.05,   23.05,   23.31],
       [1976.  ,   27.48,   26.2 ,   25.55,   24.99,   22.01,   21.18,
          20.14,   21.15,   21.27,   22.06,   24.4 ,   25.56,   26.74,
          24.18,   20.82,   22.58,   23.58],
       [1977.  ,   27.13,   28.51,   26.88,   24.22,   22.35,   22.13,
          23.07,   22.29,   22.44,   23.92,   24.48,   24.84,   27.07,
          24.48,   22.5 ,   23.61,   24.42],
       [1978.  ,   27.44,   26.55,   26.42,   23.39,   21.85,   20.03,
          21.94,   21.28,   22.49,   23.51,   25.  ,   25.66,   26.28,
          23.89,   21.08,   23.67,   23.73],
       [1979.  ,   23.86,   25.69,   24.8 ,   23.36,   23.05,   20.3 ,
          20.29,   22.42,   22.05,   24.25,   24.07,   26.02,   25.07,
          23.74,   21.  ,   23.46,   23.32],
       [1980.  ,   25.39,   27.24,   27.83,   24.63,   23.41,   21.2 ,
          21.81,   22.22,   21.05,   23.1 ,   24.2 ,   27.01,   26.22,
          25.29,   21.74,   22.78,   24.01],
       [1981.  ,   27.42,   28.06,   26.26,   23.85,   22.87,   20.94,
          19.9 ,   21.5 ,   23.19,   22.49,   25.25,   25.73,   27.5 ,
          24.33,   20.78,   23.64,   24.06],
       [1982.  ,   24.55,   27.51,   25.  ,   22.73,   21.58,   22.44,
          21.3 ,   22.34,   22.41,   23.5 ,   26.15,   24.98,   25.93,
          23.1 ,   22.03,   24.02,   23.77],
       [1983.  ,   26.81,   27.63,   25.99,   24.08,   23.82,   21.18,
          21.55,   20.91,   20.53,   23.03,   25.25,   25.94,   26.47,
          24.63,   21.21,   22.94,   23.81],
       [1984.  ,   28.56,   28.85,   26.54,   24.46,   24.77,   22.91,
          22.2 ,   21.  ,   21.91,   24.44,   25.11,   25.24,   27.78,
          25.26,   22.04,   23.82,   24.72],
       [1985.  ,   25.53,  999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,
         999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,   25.65,
         999.9 ,  999.9 ,  999.9 ,  999.9 ],
       [1986.  ,  999.9 ,   27.93,   26.95,   25.97,  999.9 ,   22.7 ,
          21.09,   22.66,   21.46,   23.04,   25.76,   26.17,  999.9 ,
          25.45,   22.15,   23.42,   24.6 ],
       [1987.  ,   27.68,   27.25,   25.86,   25.85,   22.73,   20.48,
          22.43,   20.8 ,   21.02,   22.96,   24.59,   26.07,   27.03,
          24.81,   21.24,   22.86,   23.99],
       [1988.  ,   28.82,   26.03,   26.49,   24.65,   22.7 ,   19.74,
          19.24,   21.36,   21.89,   22.19,   23.57,   25.75,   26.97,
          24.61,   20.11,   22.55,   23.56],
       [1989.  ,   26.98,   26.59,   26.45,   25.43,   21.92,   20.9 ,
          19.47,   21.67,   21.7 ,   22.07,   24.85,   25.86,   26.44,
          24.6 ,   20.68,   22.87,   23.65],
       [1990.  ,   28.63,   27.47,   27.5 ,   27.05,   22.19,   21.5 ,
          20.25,   19.95,   21.17,   24.21,   26.19,   26.08,   27.32,
          25.58,   20.57,   23.86,   24.33],
       [1991.  ,   25.44,   26.43,   25.52,   24.72,   21.69,   21.42,
          19.64,   20.91,   20.8 ,   23.59,   24.49,   27.26,   25.98,
          23.98,   20.66,   22.96,   23.39],
       [1992.  ,   27.37,  999.9 ,   26.75,   24.63,   23.55,   23.31,
          20.77,   20.94,   21.74,   23.67,   23.83,   25.38,   27.58,
          24.98,   21.67,   23.08,   24.33],
       [1993.  ,   27.48,   27.25,   26.81,   25.68,   22.85,   20.98,
         999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,   26.7 ,
          25.11,  999.9 ,  999.9 ,  999.9 ],
       [1994.  ,  999.9 ,  999.9 ,   26.56,   24.97,   23.95,   21.16,
          21.59,   20.85,   22.72,   24.56,   25.63,   27.32,  999.9 ,
          25.16,   21.2 ,   24.3 ,   24.48],
       [1995.  ,   28.64,   27.59,   26.75,   24.97,   23.17,   21.84,
          23.06,   23.9 ,   23.05,   23.21,   25.13,   25.93,   27.85,
          24.96,   22.93,   23.8 ,   24.89],
       [1996.  ,   28.48,   28.17,   26.76,   25.09,   22.01,   21.16,
          19.65,   20.59,   21.44,   23.5 ,   23.96,   26.51,   27.53,
          24.62,   20.47,   22.97,   23.9 ],
       [1997.  ,   26.52,   28.03,   25.35,   24.57,   22.43,   21.53,
          22.  ,   21.76,   23.28,   24.25,   26.27,   27.77,   27.02,
          24.12,   21.76,   24.6 ,   24.38],
       [1998.  ,   28.57,   28.32,   27.72,   26.03,   22.89,   20.59,
          21.3 ,   23.21,   23.48,   23.23,   23.54,   26.86,   28.22,
          25.55,   21.7 ,   23.42,   24.72],
       [1999.  ,   27.83,   27.96,   27.  ,   24.69,   22.21,   21.25,
          21.56,   20.94,   22.77,   21.62,   23.04,   25.7 ,   27.55,
          24.63,   21.25,   22.48,   23.98],
       [2000.  ,   27.08,   26.89,   25.85,   24.95,   22.78,   21.94,
          20.23,   21.46,   22.28,   25.24,   25.28,   26.75,   26.56,
          24.53,   21.21,   24.27,   24.14],
       [2001.  ,   28.25,   28.55,   27.83,   27.17,   23.24,   22.67,
          21.32,   22.23,   22.2 ,   23.06,   24.47,   25.82,   27.85,
          26.08,   22.07,   23.24,   24.81],
       [2002.  ,   27.04,   26.29,   27.72,   26.34,   23.38,   23.08,
          21.27,   23.49,   21.78,   25.67,   25.67,   26.45,   26.38,
          25.81,   22.61,   24.37,   24.8 ],
       [2003.  ,   26.94,  999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,
         999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,   26.96,
         999.9 ,  999.9 ,  999.9 ,  999.9 ],
       [2004.  ,  999.9 ,  999.9 ,   25.61,   25.42,   22.46,   21.5 ,
          20.7 ,   21.23,   23.76,   23.19,   25.07,   25.65,  999.9 ,
          24.5 ,   21.14,   24.01,   24.14],
       [2005.  ,   26.75,   26.12,   26.64,   26.09,   23.85,   22.41,
          20.91,   23.41,   22.18,   25.45,   24.6 ,   25.26,   26.17,
          25.53,   22.24,   24.08,   24.51],
       [2006.  ,   27.62,   27.6 ,   27.01,   24.88,   21.94,   21.39,
          21.47,   22.63,   22.23,   23.55,   24.57,   26.62,   26.83,
          24.61,   21.83,   23.45,   24.18],
       [2007.  ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,  999.9 ,
         999.9 ,  999.9 ,  999.9 ,   24.91,   25.07,   26.97,  999.9 ,
         999.9 ,  999.9 ,   24.36,  999.9 ],
       [2008.  ,   26.25,   26.54,   26.37,   25.28,   22.69,   21.59,
          21.08,   22.66,   21.88,   24.37,   24.27,   25.39,   26.59,
          24.78,   21.78,   23.51,   24.16],
       [2009.  ,   26.32,   27.96,   26.55,   24.21,   23.16,   20.71,
          21.21,   21.88,   24.01,   24.07,   27.91,   26.2 ,   26.56,
          24.64,   21.27,   25.33,   24.45],
       [2010.  ,   28.58,   29.1 ,   26.49,   24.59,   22.87,   20.35,
          21.93,   21.25,   22.74,   22.86,   24.45,   26.92,   27.96,
          24.65,   21.18,   23.35,   24.28],
       [2011.  ,   28.14,   28.69,   25.5 ,   25.48,   21.86,   20.52,
          20.61,   22.32,   21.79,   23.71,   23.24,   25.47,   27.92,
          24.28,   21.15,   22.91,   24.07],
       [2012.  ,   25.87,   27.9 ,   26.57,   25.29,   22.25,   22.67,
          21.67,   22.07,   23.02,   25.22,   24.14,   28.53,   26.41,
          24.7 ,   22.14,   24.13,   24.35],
       [2013.  ,   26.13,   28.18,   26.18,   24.2 ,   22.94,   22.59,
          20.86,   21.71,   23.42,   23.6 ,   24.75,   26.05,   27.61,
          24.44,   21.72,   23.92,   24.42],
       [2014.  ,   28.99,   28.95,   27.59,   25.99,   23.29,   22.84,
          21.44,   22.64,   23.89,   24.84,   25.84,   28.38,   28.  ,
          25.62,   22.31,   24.86,   25.2 ],
       [2015.  ,   29.93,   28.43,   26.78,   25.93,   23.18,   21.98,
          22.93,   23.53,   23.28,   25.33,   26.43,  999.9 ,   28.91,
          25.3 ,   22.81,   25.01,   25.51],
       [2016.  ,   27.08,   28.98,   27.43,   27.93,   22.93,   20.53,
          21.53,   23.23,   23.03,   24.48,   24.78,   27.22,   27.63,
          26.1 ,   21.76,   24.1 ,   24.9 ],
       [2017.  ,   28.92,   28.27,   26.97,   25.52,   22.57,   21.97,
          20.02,   22.42,   24.22,   25.97,   25.47,   27.01,   28.14,
          25.02,   21.47,   25.22,   24.96],
       [2018.  ,   28.06,   27.21,   27.81,   26.26,   23.81,   22.91,
          22.96,   21.91,   23.71,   24.56,   25.61,   27.55,   27.43,
          25.96,   22.59,   24.63,   25.15],
       [2019.  ,   30.25,   28.05,   27.5 ,   26.55,   24.85,   23.1 ,
          21.75,   22.3 ,   23.05,   25.25,  999.9 ,  999.9 ,   28.62,
          26.3 ,   22.38,   24.74,   25.51]])

In [14]:
# Lets now create the K-means clusterer that we will use to perform cluster sampling. 
# Because we want two clusters, we pass 2 to the clusterer. 
# In addition we set random_state = 1, if we would like to reproduce results 
# at some later point in time. For further info about K-means, we can refer its documentation
# by following this link: https://bit.ly/2To6GKN. This will be useful 
# to explore other model parameters that you'll get to see as an output of this cell.
# ---
# 
clusterer = KMeans(3, random_state=1)

# Then passing our data the clusterer
# ---
# 
clusterer.fit(X)

KMeans(algorithm='auto', copy_x=True, init='k-means++', max_iter=300,
       n_clusters=3, n_init=10, n_jobs=None, precompute_distances='auto',
       random_state=1, tol=0.0001, verbose=0)

In [0]:
# We then use the predict method to return the cluster that each data point 
# belongs to and then store this in a new column of our dataframe.
# ---
# 
rio_temp_df['cluster_group'] = clusterer.predict(X)

In [16]:
# We then sample our dataset to check for the assigned clustering groups 0, 1 and 2
# If we don't get to see these clusters, we can run the code again to get another set of records.
# ---
#
rio_temp_df.sample(10)

    YEAR     JAN     FEB    MAR  ...   J-J-A   S-O-N  metANN  cluster_group
20  1993   27.48   27.25  26.81  ...  999.90  999.90  999.90              2
18  1991   25.44   26.43  25.52  ...   20.66   22.96   23.39              1
14  1987   27.68   27.25  25.86  ...   21.24   22.86   23.99              1
1   1974   26.68   27.16  26.56  ...   21.24   23.41   23.91              1
41  2014   28.99   28.95  27.59  ...   22.31   24.86   25.20              1
31  2004  999.90  999.90  25.61  ...   21.14   24.01   24.14              0
16  1989   26.98   26.59  26.45  ...   20.68   22.87   23.65              1
39  2012   25.87   27.90  26.57  ...   22.14   24.13   24.35              1
28  2001   28.25   28.55  27.83  ...   22.07   23.24   24.81              1
29  2002   27.04   26.29  27.72  ...   22.61   24.37   24.80              1

[10 rows x 19 columns]

In [17]:
# To preview the records in our first cluster which is cluster 0 we can do the following:
# ---
# 
first_cluster = rio_temp_df[rio_temp_df.cluster_group.isin([0])]
first_cluster.head()

    YEAR    JAN     FEB    MAR  ...  J-J-A  S-O-N  metANN  cluster_group
13  1986  999.9   27.93  26.95  ...  22.15  23.42   24.60              0
21  1994  999.9  999.90  26.56  ...  21.20  24.30   24.48              0
31  2004  999.9  999.90  25.61  ...  21.14  24.01   24.14              0

[3 rows x 19 columns]

In [18]:
# To preview the records in our second cluster which is cluster 1, we can do the following;
# ---
#
second_cluster = rio_temp_df[rio_temp_df.cluster_group.isin([1])]
second_cluster.head()

   YEAR    JAN    FEB    MAR    APR  ...  M-A-M  J-J-A  S-O-N  metANN  cluster_group
0  1973  27.73  27.97  25.70  26.49  ...  24.87  21.98  22.33   24.16              1
1  1974  26.68  27.16  26.56  23.94  ...  24.42  21.24  23.41   23.91              1
2  1975  25.27  26.92  26.43  22.82  ...  23.54  21.05  23.05   23.31              1
3  1976  27.48  26.20  25.55  24.99  ...  24.18  20.82  22.58   23.58              1
4  1977  27.13  28.51  26.88  24.22  ...  24.48  22.50  23.61   24.42              1

[5 rows x 19 columns]

In [19]:
# We can preview the records in our third cluster which is cluster 2 as shown below:
# ---
# Side note: If you investigate this cluster, and compare it with the other clusters 
# you might even think this is a cluster of outliers owing to the large values across our features.
# ---
#
third_cluster = rio_temp_df[rio_temp_df.cluster_group.isin([2])]
third_cluster.head()

    YEAR     JAN     FEB     MAR  ...  J-J-A   S-O-N  metANN  cluster_group
12  1985   25.53  999.90  999.90  ...  999.9  999.90   999.9              2
20  1993   27.48   27.25   26.81  ...  999.9  999.90   999.9              2
30  2003   26.94  999.90  999.90  ...  999.9  999.90   999.9              2
34  2007  999.90  999.90  999.90  ...  999.9   24.36   999.9              2

[4 rows x 19 columns]

### <font color="green">Challenges</font>

In [20]:
# Challenge 1
# ---
# Perform cluster sampling on the following sales dataset. 
# ---
# Dataset url = https://bit.ly/2zYvxy0
# ---
# OUR CODE GOES BELOW
#  
data_get = pd.read_csv("https://bit.ly/2zYvxy0")
data_get.head()

  Product_Code  W0  W1  ...  Normalized 49  Normalized 50  Normalized 51
0           P1  11  12  ...           0.17           0.11           0.39
1           P2   7   6  ...           0.10           0.60           0.00
2           P3   7  11  ...           0.45           0.45           0.36
3           P4  12   8  ...           0.35           0.29           0.35
4           P5   8   5  ...           0.53           0.33           0.40

[5 rows x 107 columns]

In [0]:
# Challenge 2
# ---  
# Use your knowledge and the above example to perform cluster sampling 
# on the following python list. Create two clusters.
# ---
# age_list = [10, 15, 20, 25, 30, 35, 40, 45, 50, 55]
# ---
# OUR CODE GOES BELOW
#